Hi @bflad, thanks for the (very) quick reply!

Here is the output of the plan:
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_ecr_repository.ecr: Refreshing state... [id=foo_ecr]
aws_iam_role.role: Refreshing state... [id=test_example_role]
aws_batch_job_definition.test: Refreshing state... [id=arn:aws:batch:eu-central-1:129757167202:job-definition/test:7]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_batch_job_definition.test must be replaced
-/+ resource "aws_batch_job_definition" "test" {
      ~ arn                  = "arn:aws:batch:eu-central-1:129757167202:job-definition/test:7" -> (known after apply)
      ~ container_properties = jsonencode(
          ~ {
                command              = [
                    "start.py",
                    "Ref::S3bucket",
                    "Ref::S3key",
                ]
              - environment          = [] -> null
                image                = "foo_ecr:image"
                jobRoleArn           = "arn:aws:iam::129757167202:role/test_example_role"
                memory               = 2048
              - mountPoints          = [] -> null
              - resourceRequirements = [] -> null
              - ulimits              = [] -> null
                vcpus                = 8
              - volumes              = [] -> null
            } # forces replacement
        )
      ~ id                   = "arn:aws:batch:eu-central-1:129757167202:job-definition/test:7" -> (known after apply)
        name                 = "test"
      - parameters           = {} -> null
      ~ revision             = 7 -> (known after apply)
        type                 = "container"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```